//
// Render.cpp
#include "Windows.h"  
#include "Render.h"
#include "stdio.h"

char* g_WindowName = "B3Yena SW-Renderer 00 : Basic Frame Works";




/////////////////////////////////////////////////////////////////////////////
// 
// 추가 데이터 및 변수는 여기에... 








/////////////////////////////////////////////////////////////////////////////
//
int DataLoading()
{

	//추가 코드는 여기에...
	//...

	return TRUE;
}



/////////////////////////////////////////////////////////////////////////////
//
void DataRelease()
{
	//데이터 해제 코드의 추가는 여기에..
	//...  

}










////////////////////////////////////////////////////////////////////////////// 
//
// 장면 그리기 : 
//
void SceneRender()
{

	// 장면 갱신 
	//
	// 기하 데이터: 주인공, 몬스터, 오브제 이동, 충돌검사 등등..
	// ...
	//
	// 게임 로직 이벤트,층돌,점수계산..
	// ...


	// 장면 그리기...
	// ....


	// 장면 출력...
	// ... 

}






/****************** end of file "Render.cpp" *********************************/